update documentation
